[net]
channels=128

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu

[convolutional]
size=1
filters=512
stride=1
pad=0
activation=relu

[convolutional]
size=1
filters=21
stride=1
pad=0
activation=linear
output=1