[net]
channels=149

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=1
filters=128
stride=1
pad=0
activation=relu

[convolutional]
size=1
filters=21
stride=1
pad=0
output=1
activation=linear