[net]
channels=21

[convolutional]
filters=32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=32
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=64
size=3
stride=2
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=1
pad=1
batch_normalize=1
activation=relu

[convolutional]
filters=128
size=3
stride=2
pad=1
batch_normalize=1
activation=relu
output=1