[net]
channels=3

[convolutional]
size=3
filters=64
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=64
stride=1
pad=1
activation=relu

[maxpool]
stride=2
size=2

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu

[maxpool]
stride=2
size=2

[convolutional]
size=3
filters=256
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=256
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=256
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=256
stride=1
pad=1
activation=relu

[maxpool]
stride=2
size=2

[convolutional]
size=3
filters=512
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=512
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=256
stride=1
pad=1
activation=relu

[convolutional]
size=3
filters=128
stride=1
pad=1
activation=relu
output=1