[net]
channels=3

[convolutional]
filters=64
size=5
stride=1
pad=0
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=96
size=3
stride=1
pad=0
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=128
size=3
stride=1
pad=0
activation=relu

[maxpool]
size=2
stride=2
output=1