[net]
channels=3

[convolutional]
filters=64
size=5
stride=1
pad=0
activation=relu
batch_normalize=1

[maxpool]
size=2
stride=2

[convolutional]
filters=96
size=5
stride=1
pad=0
activation=relu
batch_normalize=1

[maxpool]
size=1
stride=1

[convolutional]
filters=128
size=3
stride=1
pad=0
activation=relu
batch_normalize=1

[maxpool]
size=1
stride=1
output=1