[net]
channels=21

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=relu
batch_normalize=1

[convolutional]
filters=64
size=3
stride=2
pad=1
activation=relu
batch_normalize=1

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=relu
batch_normalize=1

[convolutional]
filters=128
size=3
stride=2
pad=1
activation=relu
batch_normalize=1

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu
batch_normalize=1

[convolutional]
filters=256
size=3
stride=2
pad=1
activation=relu
batch_normalize=1
output=1