[net]
channels=189

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=7
filters=128
stride=1
pad=3
activation=relu

[convolutional]
size=1
filters=128
stride=1
pad=0
activation=relu

[convolutional]
size=1
filters=40
stride=1
pad=0
activation=linear
output=1